---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BalusterPattern
source: html/bb7868e3-0665-07e5-59e4-a95efb3079ab.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern

Baluster pattern class.

## Syntax (C#)
```csharp
public class BalusterPattern : IDisposable
```